Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/checklists/index.html.txt.tmx
Source language: en
Languages: ga

source: At what age can I?
ga: Cén aois is féidir liom?

source: When can you leave school? When can you drive a car?
ga: Cén uair is féidir leat an scoil a fhágáil?

source: Checklist for a non-EEA national living outside Ireland who is marrying an Irish national in Ireland
ga: Cén uair is féidir leat carr a thiomáint?

source: Describes the steps to be taken by a non-EEA national who is living outside Ireland and plans to marry an Irish national in Ireland
ga: Insíonn an doiciméad seo duit cén uair is féidir leat an scoil a fhágáil, tosú ag tiomáint, agus go leor rudaí eile

source: Checklist for people with disabilities and long-term illness
ga: Checklist when applying for Carer's Allowance

source: Checklist guide to redundancy procedures A step-by-step guide listing the procedure in a redundancy situation, your entitlements, points to check and forms to be completed if being made redundant
ga: Before you send your application for Carer's Allowance to the Department of Social Protection this checklist will help ensure that you have filled in the form correctly and have attached all necessary documentation

source: Checklist of documents needed when applying for a student grant
ga: Checklist: Appropriate basic Supplementary Welfare Allowance (SWA) rates for different personal circumstances

source: When applying for a student grant you have to provide certain documents to prove you are eligible
ga: Use this checklist to help to work out the rate of Rent Supplement a person qualifies for

source: Checklist of things to do following a bereavement
ga: Gluais de Théarmaí Inimirce

source: This checklist will help you to avoid overlooking the key items
ga: Liosta de shaintéarmaí inimirce agus míniú gearr ar is brí leo

source: Checklist of where my possessions are kept
ga: Gluais de théarmaí fostaíochta

source: Knowing where your personal possessions and valuable documents are kept, can be very useful
ga: Liosta de na téarmaí a úsáidtear sa dlí fostaíochta le míniú gearr ar bhrí na dtéarmaí

source: Use this checklist to record where your possessions and important documents are kept
ga: Seicliosta Gearán Nuair a cheannaíonn tú earraí nó seirbhísí in Éirinn nó i mBallstát eile an AE tá cosaint agat ó reachtaíocht tomhaltóirí

source: Checklist when appealing a social welfare decision
ga: Seicliosta chun iarratas a dhéanamh ar Phinsean Stáit (Neamhranníocach)

source: Outlines the stages involved in an appeal
ga: Ní mór duit doiciméid éagsúla a sholáthar nuair atá iarratas á dhéanamh agat ar Phinsean Stáit (Neamhranníocach) in Éirinn

source: Explains what to do at each stage of an appeal
ga: Cuireann an seicliosta seo faisnéis ar fáil maidir leis na doiciméid a theastaíonn

source: Checklist when applying for Carer's Allowance
ga: Seicliosta chun iarratas a dhéanamh ar shaoire cúramóra

source: Before you send your application for Carer's Allowance to the Department of Social Protection this checklist will help ensure that you have filled in the form correctly and have attached all necessary documentation
ga: Déantar cur síos ar na nósanna imeachta éagsúla a bhíonn i gceist nuair a bhíonn tú ag cur isteach ar shaoire cúramóra

source: Checklist when applying for Jobseeker's Allowance
ga: Seicliosta de nithe le déanamh ag lucht méala tar éis báis

source: When you apply for Jobseeker's Allowance, you are required to supply certain information
ga: Uaireanta is deacair don lucht méala cuimhneamh ar céard atá le déanamh díreach i ndiaidh báis nó sna laethanta agus seachtainí a leanann

source: A checklist of items to bring with you when you apply for a Jobseeker's Allowance
ga: Seo seicliosta gairid de roinnt de na nithe atá le déanamh tar éis báis ar fiú iad a mheabhrú

source: Checklist when applying for Jobseeker's Benefit
ga: Seicliosta do dhaoine faoi mhíchumas agus ar a bhfuil galar fadtéarmach

source: When you apply for Jobseeker's Benefit you must supply certain information
ga: Seicliosta do náisiúnach nach ón Limistéar Eorpach Eacnamaíoch dó, atá ina chónaí lasmuigh d’Éirinn agus atá ag pósadh náisiúnach Éireannach

source: This is a checklist of items to bring with you when you apply for Jobseeker's Benefit
ga: Déantar cur síos ar na céimeanna atá le glacadh ag náisiúnach nach ón LEE dó, atá ina chónaí lasmuigh d’Éirinn agus a bhfuil rún aige náisiúnach Éireannach a phósadh in Éirinn

source: Checklist when applying for a State Pension (Non-Contributory)
ga: Seicliosta na gcáipéisí a bhfuil gá leo nuair atáthar ag déanamh iarratais ar dheontas mic léinn

source: You are required to supply a number of documents when applying for an Irish State Pension (Non-Contributory). This checklist provides information on the documents required
ga: Má tá tú ag déanamh iarratas ar dheontas chothabhála do mhic léinn, caithfidh tú doiciméid áirithe a sholáthar mar chruthúnas ioncaim

source: Checklist when applying for carer's leave
ga: Seicliosta nuair a dhéantar siopadóireacht ar líne

source: Describes the different procedures involved when you are applying for carer's leave
ga: Liosta rudaí chun cuimhneamh orthu agus tú ag déanamh siopadóireachta ar líne

source: Checklist when shopping online
ga: Cur síos na céimeanna a bhaineann le hachomharc

source: A list of items to be aware of when you shop online
ga: Míniú na rudaí á dhéanamh ar feadh gach céim an achomhairc

source: Checklist: Appropriate basic Supplementary Welfare Allowance (SWA) rates for different personal circumstances
ga: Ní mór duit faisnéis áirithe a sholáthar chun iarratas a dhéanamh ar Liúntas Cuardaitheora Poist

source: Use this checklist to help to work out the rate of Rent Supplement a person qualifies for
ga: Seo é seicliosta rudaí a thabhairt leat nuair a dhéanann tú iarratas ar Liúntas Cuardaitheora Poist

source: Quick links to useful documents around unemployment
ga: Seo é seicliosta rudaí a thabhairt leat nuair a dhéanann tú iarratas ar Shochar Cuardaitheora Poist

source: Quicklinks to useful documents about childcare
ga: Mearnaisc le cáipéisí áisiúla faoin dífhostaíocht

source: Checklist: entitlements for older people
ga: Seicliosta: Treoir ar nósanna imeachta iomarcaíochta

source: Quick links to entitlements and services for older people
ga: Má rinneadh tú iomarcach seo treoir céim ar chéim ag liostú nós imeachta i gcás iomarcaíochta, do theidlíochtaí, pointí a sheiceáil agus foirmeacha a chomhlíonadh

source: Quicklinks to useful documents about self-employment
ga: Quicklinks to useful documents about childcare

source: When you buy goods or services in Ireland or another EU Member State you are protected by consumer legislation
ga: Mearnaisc le cáipéisí áisiúla faoi fhéinfhostaíocht

source: If your consumer rights are not being honoured you will need to complain and sometimes it can be difficult to know what to do if something goes wrong
ga: Seicliosta: teidlíochtaí agus tacaíochtaí do thuismitheoirí aonair Mearnaisc le cáipéisí áisiúla do thuismitheoirí aonair

source: Glossary of employment terms
ga: Seicliosta: teidlíochtaí do dhaoine aosta

source: A list of the terms used in employment law with a short explanation of what they mean
ga: Mearnaisc le teidlíochtaí agus seirbhísí do dhaoine aosta

source: Glossary of immigration terms
ga: Seicliosta:Cá gcoimeádtar mo mhaoin

source: A list of specific immigration terms with a brief explanation of what they mean
ga: Use this checklist to record where your possessions and important documents are kept Teanga

source: Most Read in "Reference"
ga: Ábhar is mó éilimh i "Reference"

source: Case study: Calculating your income tax
ga: Cás-staidéar: Do cháin ioncaim a ríomh
